{
    "url": "https://codeforces.com/problemset/problem/2046/A",
    "title": "A. Swap Columns and Find a Path",
    "tags": [
        "greedy",
        "sortings",
        "*1200"
    ],
    "content": "A. Swap Columns and Find a Pathtime limit per test2 secondsmemory limit per test512 megabytesinputstandard inputoutputstandard output There is a matrix consisting of 22 rows and 𝑛n columns. The rows are numbered from 11 to 22 from top to bottom; the columns are numbered from 11 to 𝑛n from left to right. Let's denote the cell on the intersection of the 𝑖i-th row and the 𝑗j-th column as (𝑖,𝑗)(i,j). Each cell contains an integer; initially, the integer in the cell (𝑖,𝑗)(i,j) is 𝑎𝑖,𝑗ai,j.You can perform the following operation any number of times (possibly zero):  choose two columns and swap them (i. e. choose two integers 𝑥x and 𝑦y such that 1≤𝑥<𝑦≤𝑛1≤x<y≤n, then swap 𝑎1,𝑥a1,x with 𝑎1,𝑦a1,y, and then swap 𝑎2,𝑥a2,x with 𝑎2,𝑦a2,y). After performing the operations, you have to choose a path from the cell (1,1)(1,1) to the cell (2,𝑛)(2,n). For every cell (𝑖,𝑗)(i,j) in the path except for the last, the next cell should be either (𝑖+1,𝑗)(i+1,j) or (𝑖,𝑗+1)(i,j+1). Obviously, the path cannot go outside the matrix.The cost of the path is the sum of all integers in all (𝑛+1)(n+1) cells belonging to the path. You have to perform the operations and choose a path so that its cost is maximum possible.InputEach test contains multiple test cases. The first line contains the number of test cases 𝑡t (1≤𝑡≤50001≤t≤5000). The description of the test cases follows. Each test case consists of three lines:  the first line contains one integer 𝑛n (1≤𝑛≤50001≤n≤5000) — the number of columns in the matrix;  the second line contains 𝑛n integers 𝑎1,1,𝑎1,2,…,𝑎1,𝑛a1,1,a1,2,…,a1,n (−105≤𝑎𝑖,𝑗≤105−105≤ai,j≤105) — the first row of the matrix;  the third line contains 𝑛n integers 𝑎2,1,𝑎2,2,…,𝑎2,𝑛a2,1,a2,2,…,a2,n (−105≤𝑎𝑖,𝑗≤105−105≤ai,j≤105) — the second row of the matrix. It is guaranteed that the sum of 𝑛n over all test cases does not exceed 50005000. OutputFor each test case, print one integer — the maximum cost of a path you can obtain.ExampleInputCopy31-10531 2 310 -5 -342 8 5 31 10 3 4OutputCopy-5\n16\n29\nNoteHere are the explanations of the first three test cases of the example. The left matrix is the matrix given in the input, the right one is the state of the matrix after several column swaps (possibly zero). The optimal path is highlighted in green...."
}