{
    "url": "https://codeforces.com/problemset/problem/2029/H",
    "title": "H. Message Spread",
    "tags": [
        "bitmasks",
        "brute force",
        "combinatorics",
        "dp",
        "*3500"
    ],
    "content": "H. Message Spreadtime limit per test12 secondsmemory limit per test1024 megabytesinputstandard inputoutputstandard outputGiven is an undirected graph with 𝑛n vertices and 𝑚m edges. Each edge connects two vertices (𝑢,𝑣)(u,v) and has a probability of 𝑝𝑞pq of appearing each day.Initially, vertex 11 has a message. At the end of the day, a vertex has a message if and only if itself or at least one of the vertices adjacent to it had the message the day before. Note that each day, each edge chooses its appearance independently.Calculate the expected number of days before all the vertices have the message, modulo 998244353998244353.InputThe first line contains two integers 𝑛n and 𝑚m (1≤𝑛≤211≤n≤21, 𝑛−1≤𝑚≤𝑛(𝑛−1)2n−1≤m≤n(n−1)2).Then 𝑚m lines follow, each containing four integers 𝑢u, 𝑣v, 𝑝p, and 𝑞q (1≤𝑢≠𝑣≤𝑛1≤u≠v≤n, 1≤𝑝<𝑞<9982443531≤p<q<998244353, gcd(𝑝,𝑞)=1gcd(p,q)=1) — there is an undirected edge between 𝑢u and 𝑣v, and it has a probability of appearance of 𝑝𝑞pq each day. It is guaranteed that there are no self-loops or multiple-edges in the graph and that the graph is connected if all of the edges appear.Additional constraint in the input: Let 𝑔𝑖,𝑗gi,j be the probability of appearance of the edge between 𝑖i and 𝑗j (𝑔𝑖,𝑗=0gi,j=0 if there is no edge between 𝑖i and 𝑗j). It is guaranteed that for any 𝑆⊆{1,2,…,𝑛}S⊆{1,2,…,n} (|𝑆|≥1|S|≥1), ∏𝑖∈𝑆(∏𝑗∈{1,2,…,𝑛}∖𝑆(1−𝑔𝑖,𝑗))≢1(mod998244353).∏i∈S(∏j∈{1,2,…,n}∖S(1−gi,j))≢1(mod998244353).OutputPrint a single integer in the only line of the output — the expected number of days, modulo 998244353998244353.Formally, let 𝑀=998244353M=998244353. It can be shown that the exact answer can be expressed as an irreducible fraction 𝑝𝑞pq, where 𝑝p and 𝑞q are integers and 𝑞≢0(mod𝑀)q≢0(modM). Output the integer equal to 𝑝⋅𝑞−1mod𝑀p⋅q−1modM. In other words, output such an integer 𝑥x that 0≤𝑥<𝑀0≤x<M and 𝑥⋅𝑞≡𝑝(mod𝑀)x⋅q≡p(modM). ExamplesInputCopy2 11 2 1 10OutputCopy10InputCopy3 31 2 1 21 3 1 22 3 1 2OutputCopy887328316InputCopy1 0OutputCopy0InputCopy5 81 2 1 111 3 2 111 4 3 111 5 4 112 4 5 112 5 6 113 4 7 114 5 8 11OutputCopy469993557InputCopy21 221 2 3 42 3 4 53 4 5 65 6 7 86 7 8 97 8 9 108 9 2 39 10 3 410 11 4 511 12 5 612 13 6 713 14 7 814 15 8 915 16 9 1016 17 2 317 18 3 418 19 4 519 20 5 620 21 6 71 10 100 100115 4 147 2204 11 1 998244352OutputCopy299529765NoteIn the first test, the answer is equal to the expected number of days before the only edge in the graph first appears, and that is 10.1=1010.1=10.In the second test, the answer is equal to 209209 before it is taken modulo 998244353998244353.In the third test, the only vertex already has the message, so the answer is 00...."
}